package collections;

/**
 * Created by root on 06.09.16.
 *
 * Запросить у контейнера итератор вызовом метода iterator().
 * Полученный итератор готов вернуть начальный элемент последовательности при первом вызове своего метода next().
 *
 * Получить следующий элемент последовательности вызовом метода next().
 *
 * Проверить, остались ли еще объекты в последовательности (метод hasNext()).
 *
 * Удалить из последовательности последний элемент, возвращенный итератором, методом remove().
 */

public class IteratorTest {
}
