package collections;

import java.util.*;


/**
 * Created by root on 06.09.16.
 *
 * Базовый контейнер ArrayList, оптимизированный для произвольного доступа к элементам,
 * но с относительно медленнными операциями вставки (удаления) элементов в середине списка.
 *
 * Контейнер LinkedList, оптимизированный для последовательного доступа,
 * с быстрыми операциями вставки (удаления) в середине списка;
 * Произвольный доступ к элементам LinkedList выполняется относительно медленно,
 * но по широте возможностей он превосходит ArrayList.
 */

public class ListTest {

    public static void main(String[] args) {

    }

}
