package collections;

/**
 * Created by root on 06.09.16.
 *
 * Listlterator — более мощная разновидность Iterator, поддерживаемая только классами List.
 * Если Iterator поддерживает перемещение только вперед, ListIterator является двусторонним.
 * Кроме того, он может выдавать индексы следующего и предыдущего элементов по отношению
 * к текущей позиции итератора в списке и заменять последний посещенный элемент методом set().
 * Вызов listIterator() возвращает ListIterator, указывающий в начало List,
 * а для создания итератора ListIterator, изначально установленного на элемент с индексом n, используется вызов listIterator(n)
 */

public class ListIteratorTest {
}
